Revit 2026 API

# NumericRevisionSettingsMinimumDigits Property

---

Controls the minimum number of digits for a revision number.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int MinimumDigits { get; set; }
```
```vb
Public Property MinimumDigits As Integer
	Get
	Set
```
```cpp
public:
property int MinimumDigits {
	int get ();
	void set (int value);
}
```
```fsharp
member MinimumDigits : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for minimumDigits is not positive. |

Use MinimumDigits to force the minimum number of digits for a revision number. Zeros will be added to the front of the revision number until the minimum number of digits is satisfied. For example, if MinimumDigits is 3, then 9 will be printed as 009 and 10 will be printed as 010. If MinimumDigits is 1, then no zeros are added to the front of the revision number. The default value for MinimumDigits is 1. Values less than 1 are not allowed.

#### Reference

NumericRevisionSettings Class

Autodesk.Revit.DB Namespace